test/load-test.yml
config:
  target: "http://localhost:3000/api"
  phases:
    - duration: 30
      arrivalRate: 5
      rampTo: 50
      name: "Ramp up load"
    - duration: 30
      arrivalRate: 50
      name: "Sustained load"
  plugins:
    ensure: {}
    apdex: {}
    metrics-by-endpoint:
      provider: "json"
      output: "endpoint-metrics.json"
    expect: {}
  apdex:
    threshold: 100
  ensure:
    thresholds:
      - http.response_time.p99: 100
      - http.response_time.median: 50

scenarios:
  - name: "User Registration and Activity Flow"
    flow:
      - loop:
          - post:
              url: "/events"
              name: "Add points to user"
              json:
                userId: "user-{{ $randomNumber(1, 100000) }}"
                pointId: "1"
                amount: "{{ $randomNumber(1, 50) }}"
                type: "add"
          - get:
              url: "/users/{{ $randomNumber(1, 100000) }}"
              name: "Get user points counter"
          - get:
              url: "/points/1/leaderboard"
              name: "Check leaderboard position"
              qs:
                limit: "{{ $randomNumber(10, 20) }}"
          - think: 1
        count: 5 # Each user will perform this loop 5 times
      - get:
          url: "/points/1/leaderboard"
          name: "Final leaderboard check"
          qs:
            limit: 20